stress-test.yml
config:
  target: "http://localhost:4000" # Asegúrate de que este sea tu puerto de ejecución
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Fase de Calentamiento (Ramp up)"
    - duration: 120
      arrivalRate: 20
      name: "Fase de Carga Constante"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Login de usuario"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "sebas@uta.edu.ec"
            password: "Password123!" # Usa una cuenta que ya exista en tu BD